<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b7bf8d8a1c28912213b7abf4b6409633c3cd0efe6d85328e97407353c1126bc3","plan_job_ref":"Job Terraform Plan #82 at https://github.com/cal-itp/data-infra/actions/runs/14453333052","plan_out_hash":"e4e7c7bb09048724ad079f31eef37e6e262c4f53ae30c4382abd8349f40a3154","plan_hash":"d83fc4a68ebfb760e488b050860cb8a8bf1e26787539691621b6b25252af2dd8","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/composer/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_composer_environment.calitp-staging-composer will be created
+   resource "google_composer_environment" "calitp-staging-composer" {
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       name             = "calitp-staging-composer"
+       project          = "cal-itp-data-infra-staging"
+       region           = "us-west2"
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       config {
+           airflow_uri                = (known after apply)
+           dag_gcs_prefix             = (known after apply)
+           enable_private_builds_only = (known after apply)
+           enable_private_environment = (known after apply)
+           environment_size           = (known after apply)
+           gke_cluster                = (known after apply)
+           node_count                 = (known after apply)
+           resilience_mode            = (known after apply)

+           data_retention_config (known after apply)

+           database_config (known after apply)

+           encryption_config (known after apply)

+           maintenance_window (known after apply)

+           node_config {
+               composer_internal_ipv4_cidr_block = (known after apply)
+               composer_network_attachment       = (known after apply)
+               disk_size_gb                      = (known after apply)
+               enable_ip_masq_agent              = (known after apply)
+               machine_type                      = (known after apply)
+               network                           = (known after apply)
+               oauth_scopes                      = (known after apply)
+               service_account                   = "projects/cal-itp-data-infra-staging/serviceAccounts/composer-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+               subnetwork                        = (known after apply)
+               zone                              = (known after apply)

+               ip_allocation_policy (known after apply)
            }

+           private_environment_config (known after apply)

+           software_config {
+               image_version           = "composer-2.8.3-airflow-2.6.3"
+               python_version          = (known after apply)
+               scheduler_count         = (known after apply)
+               web_server_plugins_mode = (known after apply)

+               cloud_data_lineage_integration (known after apply)
            }

+           web_server_config (known after apply)

+           web_server_network_access_control (known after apply)

+           workloads_config (known after apply)
        }

+       storage_config {
+           bucket = "calitp-staging-composer"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #82](https://github.com/cal-itp/data-infra/actions/runs/14453333052)